Revit 2027 API
TessellatedShapeBuilder.CloseConnectedFaceSet Method
 Closes the currently open connected face set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void CloseConnectedFaceSet()
Public Sub CloseConnectedFaceSet
public:
void CloseConnectedFaceSet()
member CloseConnectedFaceSet : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  A face set is empty and cannot be closed until some faces are added.
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace